calapi/app/controllers/api/v1/time_slots_controller.rb

SELECT "time_slots".* FROM "time_slots"
---
  def index
    requester_user_id = time_slot_params[:requester_user_id]
    creator_user_id = time_slot_params[:creator_user_id]
    from_time = time_slot_params[:from_time]
    to_time = time_slot_params[:to_time]
    include_creator = time_slot_params[:include_creator]
    include_bookings = time_slot_params[:include_bookings]

    return render json: { errors: [ "requester_user_id, creator_user_id, from_time and to_time required" ] },
      status: :bad_request unless requester_user_id && creator_user_id && from_time && to_time

    requester = User.find_by(id: requester_user_id)
    return render json: { errors: [ "user not found" ] }, status: :not_found unless requester

    time_slots = TimeSlot.where(user_id: creator_user_id)
    time_slots.includes(:booking) if include_bookings